Revit 2026 API

# FailureDefinitionAccessorHasResolutions Method

---

Checks if the FailureDefinition has at least one resolution.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool HasResolutions()
```
```vb
Public Function HasResolutions As Boolean
```
```cpp
public:
bool HasResolutions()
```
```fsharp
member HasResolutions : unit -> bool
```

#### Return Value

Boolean True if at least one resolution is defined in the FailureDefinition.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The FailureDefinitionAccessor has not been properly initialized. |

#### Reference

FailureDefinitionAccessor Class

Autodesk.Revit.DB Namespace